//
//  ResponseDictionaryTool.m
//  HuiYingTianXia
//
//  Created by 朱颖宇 on 15/6/20.
//  Copyright (c) 2015年 tsmc. All rights reserved.
//

#import "ResponseDictionaryTool.h"

@implementation ResponseDictionaryTool

+(NSDictionary *)responseDic{
    
    NSDictionary *sharedDic = @{@"00":@"交易成功",
                                
                                @"01":@"请持卡人与发卡银行联系",
                                
                                @"03":@"无效商户",
                                
                                @"04":@"此卡被没收",
                                
                                @"05":@"持卡人认证失败",
                                
                                @"06":@"商户未绑定二维码",
                                
                                @"08":@"商户已绑定二维码",
                                
                                @"09":@"该商户不在此代理商下",
                                
                                @"10":@"显示部分批准金额,提示操作员",
                                
                                @"11":@"成功,VIP客户",
                                
                                @"12":@"无效交易",
                                
                                @"13":@"无效金额",
                                
                                @"14":@"无效卡号",
                                
                                @"15":@"此卡无对应发卡方",
                                
                                @"16":@"信用卡已认证",
                                
                                @"17":@"请使用信用卡申请认证",
                                
                                @"18":@"二维码已绑定商户",
                                
                                @"21":@"该卡未初始化或睡眠卡",
                                
                                @"22":@"操作有误，或超出交易允许天数",
                                
                                @"25":@"没有原始交易，请联系发卡方",
                                
                                @"30":@"请重试",
                                
                                @"34":@"作弊卡,呑卡",
                                
                                @"38":@"密码错误次数超限，请与发卡方联系",
                                
                                @"40":@"发卡方不支持的交易类型",
                                
                                @"41":@"挂失卡，请没收（POS）",
                                
                                @"43":@"被窃卡，请没收",
                                
                                @"45":@"交易失败，芯片卡交易请插卡操作",
                                
                                @"51":@"可用余额不足",
                                
                                @"54":@"该卡已过期",
                                
                                @"55":@"密码错误,请重新输入",
                                
                                @"57":@"不允许此卡交易",
                                
                                @"58":@"终端已绑定请联系客服",
                                
                                @"59":@"卡片校验错",
                                
                                @"61":@"交易金额超限",
                                
                                @"62":@"受限制的卡",
                                
                                @"64":@"交易金额与原交易不匹配",
                                
                                @"65":@"超出消费次数限制",
                                
                                @"68":@"交易超时，请重试",
                                
                                @"75":@"密码错误次数超限",
                                
                                @"90":@"系统日切，请稍后重试",
                                
                                @"91":@"发卡方状态不正常，请稍后重试",
                                
                                @"92":@"发卡方线路异常，请稍后重试",
                                
                                @"94":@"拒绝，重复交易，请稍后重试",
                                
                                @"96":@"拒绝，交换中心异常，请稍后重试",
                                
                                @"97":@"终端未登记",
                                
                                @"98":@"发卡方超时",
                                
                                @"99":@"PIN格式错，请重新签到",
                                
                                @"A0":@"MAC校验错，请重新签到",
                                
                                @"A1":@"转账货币不一致",
                                
                                @"A2":@"交易成功，请向发卡行确认",
                                
                                @"A3":@"账户不正确",
                                
                                @"A4":@"交易成功，请向发卡行确认",
                                
                                @"A5":@"交易成功，请向发卡行确认",
                                
                                @"A6":@"交易成功，请向发卡行确认",
                                
                                @"A7":@"拒绝，交换中心异常，请稍后重试",
                                
                                @"F0":@"拒绝，终端初始化失败",
                                
                                @"ZV":@"请更新到最新版本",
                                
                                @"ZZ":@"操作失败",
                                
                                @"ZZ0":@"版本号为空",
                                
                                @"ZZ1":@"短信验证操作异常",
                                
                                @"ZZ2":@"商户不存在",
                                
                                @"ZZ3":@"验证码为空",
                                
                                @"ZZ4":@"资质上传失败，请重新上传",
                                
                                @"ZZ5":@"签名上传失败，请重新上传",
                                
                                @"ZZ6":@"提现操作异常",
                                
                                @"ZZ7":@"刷卡头检测及绑定操作异常",
                                
                                @"ZZ8":@"实名认证异常，请重试",
                                
                                @"ZZ9":@"商户同步操作异常，请重试",
                                
                                @"ZZ10":@"保存APP提额商户异常",
                                
                                @"ZZ11":@"查询APP提额商户异常",
                                
                                @"ZZ12":@"APP提额商户资质上传异常",
                                
                                @"ZZ13":@"APP提额商户已存在",
                                
                                @"ZZ14":@"终端已绑定其它用户，选择正确的用户信息登录",
                                
                                @"ZZ15":@"删除APP提额商户异常",
                                
                                @"ZZ16":@"资质图片不能为空",
                                
                                @"ZZ17":@"获取商户编号异常",
                                
                                @"ZC":@"验证码错误",
                                
                                @"ZD":@"手机号码重复注册，请直接登录",
                                
                                @"ZE":@"银行卡实名验证失败",
                                
                                @"B1":@"不支持该终端",
                                
                                @"W1":@"不允许提现",
                                
                                @"W2":@"当前时间不允许提现",
                                
                                @"W3":@"节假日不允许提现",
                                
                                @"W4":@"提现受理失败，小于提现金额",
                                
                                @"W5":@"提现受理失败，超出提现次数",
                                
                                @"W6":@"提现失败,请先完成[申请提额]",
                                
                                @"W7":@"小于终端日限额",
                                
                                @"W8":@"商户资料审核不通过,请重新提交",
                                
                                @"W9":@"提现失败,提现过于频繁",
                                
                                @"W10":@"代理商不存在",
                                
                                @"W11":@"超出交易限额或交易次数",
                                
                                @"T1":@"交易失败，正在重新审核",
                                
                                @"S5":@"APP超过交易次数",
                                
                                @"WSM":@"商户未实名认证"
                                
                                };
    
    return sharedDic;
    
}



@end
